## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.gke-cinema.google_container_cluster.primary has changed
!   resource "google_container_cluster" "primary" {
        id                          = "projects/terrateam-362405/locations/us-central1/clusters/cinema"
        name                        = "cinema"
        # (27 unchanged attributes hidden)

!       node_pool {
            name                        = "core"
            # (7 unchanged attributes hidden)

!           autoscaling {
!               min_node_count       = 2 -> 4
                # (3 unchanged attributes hidden)
            }

            # (3 unchanged blocks hidden)
        }

        # (18 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-   destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_service_account.gke-external-dns will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_service_account" "gke-external-dns" {
+       account_id   = "external-dns@terrateam-362405.iam.gserviceaccount.com"
+       display_name = (known after apply)
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       unique_id    = (known after apply)
    }

  # google_service_account_key.external-dns must be replaced
-/+ resource "google_service_account_key" "external-dns" {
!       id                 = "projects/terrateam-362405/serviceAccounts/external-dns@terrateam-362405.iam.gserviceaccount.com/keys/e8f0e95acb62d05ea04c4e866d85e194cb50c5c6" -> (known after apply)
!       name               = "projects/terrateam-362405/serviceAccounts/external-dns@terrateam-362405.iam.gserviceaccount.com/keys/e8f0e95acb62d05ea04c4e866d85e194cb50c5c6" -> (known after apply)
!       private_key        = (sensitive value)
!       public_key         = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvRENDQWVTZ0F3SUJBZ0lJVERjMjZudzgrTTh3RFFZSktvWklodmNOQVFFRkJRQXdJREVlTUJ3R0ExVUUKQXhNVk1UQTFPVGt5TmpFd01UZ3pOemN6TWprM016UXlNQ0FYRFRJeU1Ea3hPREU0TlRjMU1Gb1lEems1T1RreApNak14TWpNMU9UVTVXakFnTVI0d0hBWURWUVFERXhVeE1EVTVPVEkyTVRBeE9ETTNOek15T1Rjek5ESXdnZ0VpCk1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLQW9JQkFRQ2lRbGNzMjFuRVRRb1JybnlUdmlRWkt0Z3kKOUk2M1RjRzZXa3AxU1V2UmxNN0RPOWtmckg5NUZWV1BVZkxYOXd0Q2cwNGw4anNzdFg3ODM2eTFJdkJEZ3o3TgptTDFnNlhlMm5jTzI0WWhjMHI2c0YySHBTYzlhbUVmWFJiMWlkMkh4L2tudm5OVUo4K2FXcktZTW9SNVFOOWNlClhLekdNd3lvMmJ2a0pBc0lPNk9lMW9XT2RGb2ZzbmZJV3dmZGtwYWtIS0tWR1pMQTJlTFZpUDRXdDdLeXQ4dzAKUFBPRWxlMjdBeVBvTkRYTUZIRk9JUWxrZm1mWjBtRkF6WVpmMEtIV0FQVFF4alhRTTJmWGUyT0FRazcrRXJITgplOVJpV2hISkNmdnBDTi9peDQrcURTTjJ6UFFWVHJTcjJIMEdheTcySTEvempvRTh6NkRUSUZGUEs5czNBZ01CCkFBR2pPREEyTUF3R0ExVWRFd0VCL3dRQ01BQXdEZ1lEVlIwUEFRSC9CQVFEQWdlQU1CWUdBMVVkSlFFQi93UU0KTUFvR0NDc0dBUVVGQndNQ01BMEdDU3FHU0liM0RRRUJCUVVBQTRJQkFRQXNqKzY4QWVFRjhKT05ZRnljVjFocwozTTNScUVNNXVqamxCNDZiV0hvRjhoclR5bWo1UEpSTkM4aHkwTFJyN1dqQ2hEd0EyUTM3WjJTTUg2M0RDZDc2CmlZZlh0R2tGdzV3R3htWlh2bjNNL2NWU0pxNEUrdENzTDhpY00xMFJsSW1zWWFvZFU4TlBuR2pUZElxSnFjQWkKR3U0VktxWG9LODVhYXBiUlNaUTJoWC9xWk11eDlGR2VRS3ZlUHc3V0pnbk91QVg5RDdRVVBVL0U1TnZiUWIyOApMTnlRT1M4NGV0dTNvd084Nk9EeE5KZ01OME9JY0RWLy9HUmY5R3o4L2trbGcrNmpNQ3Fta0tnWng1YXYrMDJXCmpXelA3S2RxNzVSUnd5Vk13ZmwxUWs0bWlZN28xWjJmYUFFNVFKMGlQeVZ3N2IxV2dlUkUrbWsrdllSelU2TW0KLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> (known after apply)
!       service_account_id = "projects/terrateam-362405/serviceAccounts/external-dns@terrateam-362405.iam.gserviceaccount.com" -> (known after apply) # forces replacement
!       valid_after        = "2022-09-18T18:57:50Z" -> (known after apply)
!       valid_before       = "9999-12-31T23:59:59Z" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # kubernetes_secret.external-dns-credentials will be updated in-place
!   resource "kubernetes_secret" "external-dns-credentials" {
!       data      = (sensitive value)
        id        = "dns/external-dns"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.asm.data.google_container_cluster.asm will be read during apply
  # (config refers to values not yet known)
 <= data "google_container_cluster" "asm" {
+       addons_config                     = (known after apply)
+       authenticator_groups_config       = (known after apply)
+       binary_authorization              = (known after apply)
+       cluster_autoscaling               = (known after apply)
+       cluster_ipv4_cidr                 = (known after apply)
+       confidential_nodes                = (known after apply)
+       database_encryption               = (known after apply)
+       datapath_provider                 = (known after apply)
+       default_max_pods_per_node         = (known after apply)
+       default_snat_status               = (known after apply)
+       description                       = (known after apply)
+       dns_config                        = (known after apply)
+       enable_autopilot                  = (known after apply)
+       enable_binary_authorization       = (known after apply)
+       enable_intranode_visibility       = (known after apply)
+       enable_kubernetes_alpha           = (known after apply)
+       enable_legacy_abac                = (known after apply)
+       enable_shielded_nodes             = (known after apply)
+       enable_tpu                        = (known after apply)
+       endpoint                          = (known after apply)
+       id                                = (known after apply)
+       initial_node_count                = (known after apply)
+       ip_allocation_policy              = (known after apply)
+       label_fingerprint                 = (known after apply)
+       location                          = "us-central1"
+       logging_config                    = (known after apply)
+       logging_service                   = (known after apply)
+       maintenance_policy                = (known after apply)
+       master_auth                       = (known after apply)
+       master_authorized_networks_config = (known after apply)
+       master_version                    = (known after apply)
+       mesh_certificates                 = (known after apply)
+       min_master_version                = (known after apply)
+       monitoring_config                 = (known after apply)
+       monitoring_service                = (known after apply)
+       name                              = (known after apply)
+       network                           = (known after apply)
+       network_policy                    = (known after apply)
+       networking_mode                   = (known after apply)
+       node_config                       = (known after apply)
+       node_locations                    = (known after apply)
+       node_pool                         = (known after apply)
+       node_version                      = (known after apply)
+       notification_config               = (known after apply)
+       operation                         = (known after apply)
+       private_cluster_config            = (known after apply)
+       private_ipv6_google_access        = (known after apply)
+       project                           = "terrateam-362405"
+       release_channel                   = (known after apply)
+       remove_default_node_pool          = (known after apply)
+       resource_labels                   = (known after apply)
+       resource_usage_export_config      = (known after apply)
+       self_link                         = (known after apply)
+       service_external_ips_config       = (known after apply)
+       services_ipv4_cidr                = (known after apply)
+       subnetwork                        = (known after apply)
+       tpu_ipv4_cidr_block               = (known after apply)
+       vertical_pod_autoscaling          = (known after apply)
+       workload_identity_config          = (known after apply)
    }

  # module.asm.google_gke_hub_membership.membership[0] must be replaced
-/+ resource "google_gke_hub_membership" "membership" {
!       id            = "projects/terrateam-362405/locations/global/memberships/cinema-membership" -> (known after apply)
-       labels        = {} -> null
!       membership_id = "cinema-membership" -> (known after apply) # forces replacement
!       name          = "projects/terrateam-362405/locations/global/memberships/cinema-membership" -> (known after apply)
        # (1 unchanged attribute hidden)

!       endpoint {
!           gke_cluster {
!               resource_link = "//container.googleapis.com/projects/terrateam-362405/locations/us-central1/clusters/cinema" -> (known after apply) # forces replacement
            }
        }
    }

  # module.gke-cinema.google_container_node_pool.pools["core"] will be destroyed
  # (because key ["core"] is not in for_each map)
-   resource "google_container_node_pool" "pools" {
-       cluster                     = "cinema" -> null
-       id                          = "projects/terrateam-362405/locations/us-central1/clusters/cinema/nodePools/core" -> null
-       initial_node_count          = 1 -> null
-       instance_group_urls         = [
-           "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-a/instanceGroupManagers/gke-cinema-core-d283edfc-grp",
-           "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-b/instanceGroupManagers/gke-cinema-core-c273229c-grp",
        ] -> null
-       location                    = "us-central1" -> null
-       managed_instance_group_urls = [
-           "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-a/instanceGroups/gke-cinema-core-d283edfc-grp",
-           "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-b/instanceGroups/gke-cinema-core-c273229c-grp",
        ] -> null
-       max_pods_per_node           = 65 -> null
-       name                        = "core" -> null
-       node_count                  = 1 -> null
-       node_locations              = [
-           "us-central1-a",
-           "us-central1-b",
        ] -> null
-       project                     = "terrateam-362405" -> null
-       version                     = "1.24.3-gke.2100" -> null

-       autoscaling {
-           max_node_count       = 4 -> null
-           min_node_count       = 4 -> null
-           total_max_node_count = 0 -> null
-           total_min_node_count = 0 -> null
        }

-       management {
-           auto_repair  = true -> null
-           auto_upgrade = true -> null
        }

-       node_config {
-           disk_size_gb      = 15 -> null
-           disk_type         = "pd-standard" -> null
-           guest_accelerator = [] -> null
-           image_type        = "COS_CONTAINERD" -> null
-           labels            = {
-               "cluster_name" = "cinema"
-               "node_pool"    = "core"
            } -> null
-           local_ssd_count   = 0 -> null
-           machine_type      = "e2-highcpu-4" -> null
-           metadata          = {
-               "cluster_name"             = "cinema"
-               "disable-legacy-endpoints" = "true"
-               "node_pool"                = "core"
            } -> null
-           oauth_scopes      = [
-               "https://www.googleapis.com/auth/logging.write",
-               "https://www.googleapis.com/auth/monitoring",
            ] -> null
-           preemptible       = false -> null
-           service_account   = "terrateam-tf@terrateam-362405.iam.gserviceaccount.com" -> null
-           spot              = false -> null
-           tags              = [
-               "gke-cinema",
-               "gke-cinema-core",
            ] -> null
-           taint             = [] -> null

-           shielded_instance_config {
-               enable_integrity_monitoring = true -> null
-               enable_secure_boot          = false -> null
            }

-           workload_metadata_config {
-               mode = "GKE_METADATA" -> null
            }
        }

-       timeouts {
-           create = "45m" -> null
-           delete = "45m" -> null
-           update = "45m" -> null
        }

-       upgrade_settings {
-           max_surge       = 1 -> null
-           max_unavailable = 0 -> null
        }
    }

  # module.gke-cinema.google_container_node_pool.pools["primary"] will be created
+   resource "google_container_node_pool" "pools" {
+       cluster                     = "cinema"
+       id                          = (known after apply)
+       initial_node_count          = 4
+       instance_group_urls         = (known after apply)
+       location                    = "us-central1"
+       managed_instance_group_urls = (known after apply)
+       max_pods_per_node           = (known after apply)
+       name                        = "primary"
+       name_prefix                 = (known after apply)
+       node_count                  = (known after apply)
+       node_locations              = [
+           "us-central1-a",
+           "us-central1-b",
        ]
+       operation                   = (known after apply)
+       project                     = "terrateam-362405"
+       version                     = (known after apply)

+       autoscaling {
+           max_node_count = 4
+           min_node_count = 4
        }

+       management {
+           auto_repair  = true
+           auto_upgrade = true
        }

+       node_config {
+           disk_size_gb      = 15
+           disk_type         = "pd-standard"
+           guest_accelerator = []
+           image_type        = "COS_CONTAINERD"
+           labels            = {
+               "cluster_name" = "cinema"
+               "node_pool"    = "primary"
            }
+           local_ssd_count   = 0
+           machine_type      = "e2-highcpu-4"
+           metadata          = {
+               "cluster_name"             = "cinema"
+               "disable-legacy-endpoints" = "true"
+               "node_pool"                = "primary"
            }
+           min_cpu_platform  = (known after apply)
+           oauth_scopes      = [
+               "https://www.googleapis.com/auth/logging.write",
+               "https://www.googleapis.com/auth/monitoring",
            ]
+           preemptible       = false
+           service_account   = "terrateam-tf@terrateam-362405.iam.gserviceaccount.com"
+           spot              = false
+           tags              = [
+               "gke-cinema",
+               "gke-cinema-primary",
            ]
+           taint             = (known after apply)

+           shielded_instance_config {
+               enable_integrity_monitoring = true
+               enable_secure_boot          = false
            }

+           workload_metadata_config {
+               mode = "GKE_METADATA"
            }
        }

+       timeouts {
+           create = "45m"
+           delete = "45m"
+           update = "45m"
        }

+       upgrade_settings {
+           max_surge       = 1
+           max_unavailable = 0
        }
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.additional_components[0] must be replaced
-/+ resource "null_resource" "additional_components" {
!       id       = "6551104818098617954" -> (known after apply)
!       triggers = {
-           "additional_components_command" = ".terraform/modules/asm.cpr/scripts/check_components.sh gcloud kubectl"
-           "arguments"                     = "77a2b10d38c550faf4633c35dc8107fd"
-           "md5"                           = "a65cfbc45ca76efed4d2aa587cee9dc6"
        } -> (known after apply) # forces replacement
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.run_command[0] must be replaced
-/+ resource "null_resource" "run_command" {
!       id       = "4738488496044340553" -> (known after apply)
!       triggers = {
-           "arguments"             = "77a2b10d38c550faf4633c35dc8107fd"
-           "create_cmd_body"       = "cinema us-central1 terrateam-362405 false false .terraform/modules/asm/modules/asm/scripts/create_cpr.sh asm-managed regular true false"
-           "create_cmd_entrypoint" = ".terraform/modules/asm.cpr/modules/kubectl-wrapper/scripts/kubectl_wrapper.sh"
-           "gcloud_bin_abs_path"   = "/google-cloud-sdk/bin"
-           "md5"                   = "a65cfbc45ca76efed4d2aa587cee9dc6"
        } -> (known after apply) # forces replacement
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.run_destroy_command[0] must be replaced
-/+ resource "null_resource" "run_destroy_command" {
!       id       = "6489683141425118546" -> (known after apply)
!       triggers = {
-           "destroy_cmd_body"       = "cinema us-central1 terrateam-362405 false false .terraform/modules/asm/modules/asm/scripts/destroy_cpr.sh asm-managed"
-           "destroy_cmd_entrypoint" = ".terraform/modules/asm.cpr/modules/kubectl-wrapper/scripts/kubectl_wrapper.sh"
-           "gcloud_bin_abs_path"    = "/google-cloud-sdk/bin"
        } -> (known after apply) # forces replacement
    }

Plan: 6 to add, 1 to change, 6 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
